In [2]:
import pandas as pd
from datetime import datetime

#pd.date_range(datetime.today(), periods=10).to_pydatetime().tolist()
#d = pd.date_range(start='2020-01-01', end='2020-01-10')

d = ['20200101','20200110','20200102','20200203','20200109','20200101','20200110','20200102','20200203','20200109']
col1 = ['a','b','c','d','e','f','g','h','i','j']
col2 = [1,8,3,6,5,4,7,2,9,0]
data = {'date' : d , 'col1' : col1, 'col2':col2 }
df = pd.DataFrame(data)
df.pivot_table(index = 'date', columns='col1', values='col2')

col1        a    b    c    d    e    f    g    h    i    j
date
20200101  1.0  NaN  NaN  NaN  NaN  4.0  NaN  NaN  NaN  NaN
20200102  NaN  NaN  3.0  NaN  NaN  NaN  NaN  2.0  NaN  NaN
20200109  NaN  NaN  NaN  NaN  5.0  NaN  NaN  NaN  NaN  0.0
20200110  NaN  8.0  NaN  NaN  NaN  NaN  7.0  NaN  NaN  NaN
20200203  NaN  NaN  NaN  6.0  NaN  NaN  NaN  NaN  9.0  NaN

In [14]:
import pandas as pd
from datetime import datetime
# pd.date_range(datetime.today(), periods=10).to_pydatetime().tolist()
# d = pd.date_range(start='2020-01-01', end='2020-01-10')
d = ['20200101','20200101','20200101','20200102','20200102',    
    '20200102','20200103','20200103','20200103']
col1 = ['aa','bb','cc','aa','bb','cc','aa','dd','ee']
col2 = [1,2,3,1,2,3,1,2,3]
data = {'date':d, 'col1':col1, 'col2':col2}
df = pd.DataFrame(data)
df
df.pivot_table(index='date', columns='col1',values='col2')

col1       aa   bb   cc   dd   ee
date
20200101  1.0  2.0  3.0  NaN  NaN
20200102  1.0  2.0  3.0  NaN  NaN
20200103  1.0  NaN  NaN  2.0  3.0

In [4]:
col1 = ['abb','def','dda','abb','abb']
col2 = ['x1','x2','y1','y2','x2']
col3 = [2,2,2,2,2]
data = {'col1':col1, 'col2':col2, 'col3':col3}
df = pd.DataFrame(data)
df
df.pivot_table(index='col1', columns='col2',values='col3').fillna(0)

col2   x1   x2   y1   y2
col1
abb   2.0  2.0  0.0  2.0
dda   0.0  0.0  2.0  0.0
def   0.0  2.0  0.0  0.0

In [14]:
df2 = pd.DataFrame(
    {'foo':['one','one','one','two','two','two'],
    'bar':['A','B','C','A','B','C'],
    'baz':[1,2,3,4,5,6],
    'zoo':['x','y','z','q','w','t'],
    })

df2.pivot(index='foo', columns='bar', values='baz') # 방법1
df2.pivot(index='foo', columns='bar')['baz'] # 방법2. 똑같은 결과 나옴.
# df2.set_index(['foo','bar'])[['baz']].unstack() # 방법3. 위의 피벗과 결과 같음.

df2.pivot(index='foo', columns='bar', values=['baz','zoo'])

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

In [24]:
import pandas as pd
import numpy as numpy

df = pd.read_excel("../20200608_pyda1/data/02. sales-funnel.xlsx")
df.shape
df.index
df.head()

   Account                          Name  ...  Price     Status
0   714466               Trantow-Barrows  ...  30000  presented
1   714466               Trantow-Barrows  ...  10000  presented
2   714466               Trantow-Barrows  ...   5000    pending
3   737550  Fritsch, Russel and Anderson  ...  35000   declined
4   146832                  Kiehn-Spinka  ...  65000        won

[5 rows x 8 columns]

In [23]:
pd.pivot_table(df, index = ['Account'])
pd.pivot_table(df, index=["Account"], columns=['Name'], values=['Price'])

             Price                               ...
Name    Barton LLC Fritsch, Russel and Anderson  ... Stokes LLC Trantow-Barrows
Account                                          ...
141962         NaN                          NaN  ...        NaN             NaN
146832         NaN                          NaN  ...        NaN             NaN
163416         NaN                          NaN  ...        NaN             NaN
218895         NaN                          NaN  ...        NaN             NaN
239344         NaN                          NaN  ...     7500.0             NaN
307599         NaN                          NaN  ...        NaN             NaN
412290         NaN                          NaN  ...        NaN             NaN
688981         NaN                          NaN  ...        NaN             NaN
714466         NaN                          NaN  ...        NaN         15000.0
729833         NaN                          NaN  ...        NaN             NaN
737550         NaN                      35000.0  ...        NaN             NaN
740150     35000.0                          NaN  ...        NaN             NaN

[12 rows x 12 columns]

In [25]:
pd.pivot_table(df, index = ['Name'])

                              Account   Price  Quantity
Name
Barton LLC                     740150   35000  1.000000
Fritsch, Russel and Anderson   737550   35000  1.000000
Herman LLC                     141962   65000  2.000000
Jerde-Hilpert                  412290    5000  2.000000
Kassulke, Ondricka and Metz    307599    7000  3.000000
Keeling LLC                    688981  100000  5.000000
Kiehn-Spinka                   146832   65000  2.000000
Koepp Ltd                      729833   35000  2.000000
Kulas Inc                      218895   25000  1.500000
Purdy-Kunde                    163416   30000  1.000000
Stokes LLC                     239344    7500  1.000000
Trantow-Barrows                714466   15000  1.333333

In [27]:
pd.pivot_table(df, index=["Name","Rep","Manager"])
pd.pivot_table(df, index=["Manager","Rep"],values=["Price"])

                                    Price
Manager       Rep
Debra Henley  Craig Booker   20000.000000
              Daniel Hilton  38333.333333
              John Smith     20000.000000
Fred Anderson Cedric Moss    27500.000000
              Wendy Yule     44250.000000

In [31]:
import numpy as np

pd.pivot_table(df, index=["Manager","Rep"],values=["Price"], aggfunc=np.sum)

                              Price
Manager       Rep
Debra Henley  Craig Booker    80000
              Daniel Hilton  115000
              John Smith      40000
Fred Anderson Cedric Moss    110000
              Wendy Yule     177000

In [32]:
pd.pivot_table(df, index=["Manager","Rep","Product"], values=["Price","Quantity"], aggfunc=[np.mean,np.sum] ,                       fill_value=0, margins=True)

                                                 mean  ...      sum
                                                Price  ... Quantity
Manager       Rep           Product                    ...
Debra Henley  Craig Booker  CPU          32500.000000  ...        2
                            Maintenance   5000.000000  ...        2
                            Software     10000.000000  ...        1
              Daniel Hilton CPU          52500.000000  ...        4
                            Software     10000.000000  ...        1
              John Smith    CPU          35000.000000  ...        1
                            Maintenance   5000.000000  ...        2
Fred Anderson Cedric Moss   CPU          47500.000000  ...        3
                            Maintenance   5000.000000  ...        1
                            Software     10000.000000  ...        1
              Wendy Yule    CPU          82500.000000  ...        7
                            Maintenance   7000.000000  ...        3
                            Monitor       5000.000000  ...        2
All                                      30705.882353  ...       30

[14 rows x 4 columns]